"""
Задача №2
В олімпіаді з інформатики брало участь кілька осіб.
Гарантується, що в кожному класі був хоча б один учасник.
Визначте і запишіть у файл середні бали учасників олімпіади в 9 класі,
в 10 класі, в 11 класі. Інформація про результати олімпіади записана у файлі,
кожен рядок якого має вигляд: прізвище ім’я клас бал.
Прізвище та ім’я - текстові рядки, що не містять пропусків.
Клас - одне з трьох чисел 9, 10, 11. Бал - ціле число від 0 до 100.
Автор: Мотовилець Марія
"""
with open("input.txt", "r") as file:
    lines = file.readlines()
sum9 = 0
sum10 = 0
sum11 = 0
num9 = 0
num10 = 0
num11 = 0
for el in lines:
    name, surname, c, m = el.split()
    if c == '9':
        sum9 += int(m)
        num9 += 1
    if c == '10':
        sum10 += int(m)
        num10 += 1
    if c == '11':
        sum11 += int(m)
        num11 += 1
avr9 = sum9/num9    
avr10 = sum10/num10
avr11 = sum11/num11 

with open("output.txt", "w") as file:
    file.write(f'{avr9} {avr10} {avr11}')
